Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
alse
      + id                          = (known after apply)
      + name                        = "svep-backend-concatStarter"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.createPages will be created
  + resource "aws_sns_topic" "createPages" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-createPages"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.formatOutput will be created
  + resource "aws_sns_topic" "formatOutput" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-formatOutput"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.initQuery will be created
  + resource "aws_sns_topic" "initQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-initQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginClinvar will be created
  + resource "aws_sns_topic" "pluginClinvar" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginClinvar"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginConsequence will be created
  + resource "aws_sns_topic" "pluginConsequence" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginConsequence"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginGnomad will be created
  + resource "aws_sns_topic" "pluginGnomad" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginGnomad"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginGnomadConstraint will be created
  + resource "aws_sns_topic" "pluginGnomadConstraint" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginGnomadConstraint"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginGnomadOneKG will be created
  + resource "aws_sns_topic" "pluginGnomadOneKG" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginGnomadOneKG"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.queryGTF will be created
  + resource "aws_sns_topic" "queryGTF" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-queryGTF"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.queryVCF will be created
  + resource "aws_sns_topic" "queryVCF" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-queryVCF"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.queryVCFsubmit will be created
  + resource "aws_sns_topic" "queryVCFsubmit" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-queryVCFsubmit"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.sendJobEmail will be created
  + resource "aws_sns_topic" "sendJobEmail" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-sendJobEmail"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.updateReferenceFiles will be created
  + resource "aws_sns_topic" "updateReferenceFiles" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-updateReferenceFiles"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.clearTempAndRegions will be created
  + resource "aws_sns_topic_subscription" "clearTempAndRegions" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.concat will be created
  + resource "aws_sns_topic_subscription" "concat" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.concatPages will be created
  + resource "aws_sns_topic_subscription" "concatPages" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.concatStarter will be created
  + resource "aws_sns_topic_subscription" "concatStarter" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.createPages will be created
  + resource "aws_sns_topic_subscription" "createPages" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.formatOutput will be created
  + resource "aws_sns_topic_subscription" "formatOutput" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.initQuery will be created
  + resource "aws_sns_topic_subscription" "initQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginClinvar will be created
  + resource "aws_sns_topic_subscription" "pluginClinvar" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginConsequence will be created
  + resource "aws_sns_topic_subscription" "pluginConsequence" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomad will be created
  + resource "aws_sns_topic_subscription" "pluginGnomad" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomadConstraint will be created
  + resource "aws_sns_topic_subscription" "pluginGnomadConstraint" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomadOneKG will be created
  + resource "aws_sns_topic_subscription" "pluginGnomadOneKG" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.queryGTF will be created
  + resource "aws_sns_topic_subscription" "queryGTF" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.queryVCF will be created
  + resource "aws_sns_topic_subscription" "queryVCF" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.queryVCFsubmit will be created
  + resource "aws_sns_topic_subscription" "queryVCFsubmit" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.sendJobEmail will be created
  + resource "aws_sns_topic_subscription" "sendJobEmail" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.updateReferenceFiles will be created
  + resource "aws_sns_topic_subscription" "updateReferenceFiles" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sqs_queue.batch_submit_qld will be created
  + resource "aws_sqs_queue" "batch_submit_qld" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "svep-backend-batchSubmitDLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "ap-southeast-3"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.svep[0].aws_sqs_queue.batch_submit_queue will be created
  + resource "aws_sqs_queue" "batch_submit_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "svep-backend-batchSubmitQueue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "ap-southeast-3"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.svep[0].null_resource.init_script will be created
  + resource "null_resource" "init_script" {
      + id       = (known after apply)
      + triggers = {
          + "script_hash" = "01e727bcc92faebfec86a58bf89ce955a0845b92"
        }
    }

  # module.webgui.data.external.build will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build" {
      + id          = (known after apply)
      + program     = [
          + "python",
          + "build_and_hash.py",
        ]
      + query       = {
          + "api_endpoint_clinic"     = (known after apply)
          + "api_endpoint_sbeacon"    = "https://d336loxxgz6kuf.cloudfront.net/prod/"
          + "base_range"              = "5000"
          + "build_command"           = "./node_modules/.bin/ng build --configuration production --subresource-integrity"
          + "build_destiation"        = "../webapp/dist/beacon-v2-ui/browser/"
          + "clinic_mode"             = "svep"
          + "clinic_warning_dp"       = "10"
          + "clinic_warning_filter"   = "PASS"
          + "clinic_warning_gq"       = "15"
          + "clinic_warning_mq"       = "30"
          + "clinic_warning_qd"       = "20"
          + "clinic_warning_qual"     = "20"
          + "data_portal_bucket"      = "gaspi-dataportal-20250725085318492000000003"
          + "hub_name"                = "RSSARDJITO"
          + "identity_pool_id"        = "ap-southeast-3:7d4c5257-bcbe-491b-9a7e-4ddc930fc713"
          + "install_command"         = "pnpm install"
          + "region"                  = "ap-southeast-3"
          + "user_pool_id"            = "ap-southeast-3_BPVU2Ch1c"
          + "user_pool_web_client_id" = "3on072da1li7d88l1aj21appd9"
          + "webapp_dir"              = "../webapp/"
        }
      + result      = (known after apply)
      + working_dir = "webgui/terraform-aws"
    }

  # module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy will be updated in-place
  ~ resource "aws_cloudfront_response_headers_policy" "bui-security-headers-policy" {
        id      = "e545f1e3-9373-4958-a9f7-f5ca514e086c"
        name    = "bui-security-headers-policy"
        # (3 unchanged attributes hidden)

      ~ security_headers_config {
          ~ content_security_policy {
              ~ content_security_policy = "default-src 'none'; script-src 'self' 'sha256-2P8mXF+NOGY5a6oJ1jDjLINrckn9RgJYdEesn+Qf4rQ=' https://cdn.jsdelivr.net/npm/igv@3.1.2/dist/igv.min.js; style-src 'self' 'unsafe-inline'; font-src 'self' https://fonts.gstatic.com; img-src 'self' data: content: blob: https://gaspi-dataportal-20250725085318492000000003.s3.ap-southeast-3.amazonaws.com; form-action 'self'; connect-src 'self' https://d336loxxgz6kuf.cloudfront.net/prod/ https://d1mx01aqu9rq32.cloudfront.net/prod/ https://cognito-identity.ap-southeast-3.amazonaws.com https://cognito-idp.ap-southeast-3.amazonaws.com https://gaspi-dataportal-20250725085318492000000003.s3.ap-southeast-3.amazonaws.com https://api.pricing.us-east-1.amazonaws.com https://igv.org/genomes/ https://hgdownload.soe.ucsc.edu/goldenPath/hg38/ https://eutils.ncbi.nlm.nih.gov/entrez/eutils/ https://r4.ontoserver.csiro.au https://www.ebi.ac.uk; frame-ancestors 'none'; base-uri 'self'; object-src 'none'; manifest-src 'self';" -> (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v1.1.0-42-gfe8314d+" -> "v1.1.0-47-g6115031e+"
        id                            = "webgui-bucket-20250725085326820600000001/version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "3010126990667777580" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "95d91d746071eb1409d118d1b9269c96991a4264" -> (known after apply)
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "282205930702706147" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "95d91d746071eb1409d118d1b9269c96991a4264" -> (known after apply)
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "fc9fd40a-1d92-73d1-fe1c-da11bffbd7ab" -> (known after apply)
      ~ triggers_replace = [
          ~ "v1.1.0-42-gfe8314d+" -> "v1.1.0-47-g6115031e+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8260682296863308793" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1738832213615304000" -> "1758509774966806800"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7868214476964627109" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739778706149415000" -> "1758509774828533800"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8373297738642881112" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754895595679152000" -> "1758509773816924000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3493404622660880582" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1746518878128005000" -> "1758509773127743000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8312914464491526397" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753069865729906000" -> "1758509774086556000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_lifecycle_policy.this[0] will be destroyed
  # (because module.pgxflow[0].module.docker_image_qcFigures_lambda is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "this" {
      - id          = "pgxflow-qcfigures-lambda-containers" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep only the last 1 images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber = 1
                          - countType   = "imageCountMoreThan"
                          - tagStatus   = "any"
                        }
                    },
                ]
            }
        ) -> null
      - region      = "ap-southeast-3" -> null
      - registry_id = "209479276142" -> null
      - repository  = "pgxflow-qcfigures-lambda-containers" -> null
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0] will be destroyed
  # (because module.pgxflow[0].module.docker_image_qcFigures_lambda is not in configuration)
  - resource "aws_ecr_repository" "this" {
      - arn                  = "arn:aws:ecr:ap-southeast-3:209479276142:repository/pgxflow-qcfigures-lambda-containers" -> null
      - force_delete         = true -> null
      - id                   = "pgxflow-qcfigures-lambda-containers" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "pgxflow-qcfigures-lambda-containers" -> null
      - region               = "ap-southeast-3" -> null
      - registry_id          = "209479276142" -> null
      - repository_url       = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this will be destroyed
  # (because module.pgxflow[0].module.docker_image_qcFigures_lambda is not in configuration)
  - resource "docker_image" "this" {
      - force_remove = false -> null
      - id           = "sha256:ddd951bdb022f5e0b8870afe4950c5677ce3989c378e4adae22730948a62e7e9209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers" -> null
      - image_id     = "sha256:ddd951bdb022f5e0b8870afe4950c5677ce3989c378e4adae22730948a62e7e9" -> null
      - keep_locally = false -> null
      - name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers" -> null
      - triggers     = {
          - "dir_sha" = "2a53c8e7f59c3ae4cdafea945e90e0e1a200969f"
        } -> null
        # (1 unchanged attribute hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this will be destroyed
  # (because module.pgxflow[0].module.docker_image_qcFigures_lambda is not in configuration)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:af21642368ba9495f767aa9cdbf1505a5e5737d31624f938d7274d3398853607" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers" -> null
      - sha256_digest        = "sha256:af21642368ba9495f767aa9cdbf1505a5e5737d31624f938d7274d3398853607" -> null
      - triggers             = {
          - "dir_sha" = "2a53c8e7f59c3ae4cdafea945e90e0e1a200969f"
        } -> null
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchStarter is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchStarter" -> null
      - id                = "/aws/lambda/pgxflow-backend-batchStarter" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-batchStarter" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "STAGING"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all          = {
          - "Environment" = "STAGING"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_iam_role.lambda[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchStarter is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::209479276142:role/pgxflow-backend-batchStarter" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-09-16T08:40:22Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-batchStarter" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-batchStarter" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "STAGING"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all              = {
          - "Environment" = "STAGING"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "GXC"
        } -> null
      - unique_id             = "AROATBRPQCZXBOCV6X7HM" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-batchStarter-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "sqs:ReceiveMessage",
                              - "sqs:GetQueueAttributes",
                              - "sqs:DeleteMessage",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sqs:ap-southeast-3:209479276142:pgxflow-backend-batchSubmitQueue"
                        },
                      - {
                          - Action   = "sns:Publish"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-initFlow"
                        },
                      - {
                          - Action   = "lambda:GetAccountSettings"
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                      - {
                          - Action   = "cloudwatch:GetMetricStatistics"
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-batchStarter-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchStarter:*:*",
                              - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchStarter:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchStarter is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-batchStarter:pgxflow-backend-batchStarter-0" -> null
      - name        = "pgxflow-backend-batchStarter-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:ap-southeast-3:209479276142:pgxflow-backend-batchSubmitQueue"
                    },
                  - {
                      - Action   = "sns:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-initFlow"
                    },
                  - {
                      - Action   = "lambda:GetAccountSettings"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cloudwatch:GetMetricStatistics"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-batchStarter" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_iam_role_policy.logs[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchStarter is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-batchStarter:pgxflow-backend-batchStarter-logs" -> null
      - name        = "pgxflow-backend-batchStarter-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchStarter:*:*",
                          - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchStarter:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-batchStarter" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchStarter is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-batchStarter" -> null
      - code_sha256                    = "8EbajZ5yJZ0uf4Qra2OU1aKgJ4dyRC3blgRDmPFDTQw=" -> null
      - description                    = "Scheduler for PGxFlow batch submissions" -> null
      - filename                       = "builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip" -> null
      - function_name                  = "pgxflow-backend-batchStarter" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-batchStarter" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-batchStarter/invocations" -> null
      - last_modified                  = "2025-09-22T01:56:40.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:pgxflow_backend_python_modules_layer:4",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-batchStarter:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-batchStarter:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::209479276142:role/pgxflow-backend-batchStarter" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "8EbajZ5yJZ0uf4Qra2OU1aKgJ4dyRC3blgRDmPFDTQw=" -> null
      - source_code_size               = 1498 -> null
      - tags                           = {
          - "Environment"           = "STAGING"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "GXC"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "STAGING"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "GXC"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (5 unchanged attributes hidden)

      - environment {
          - variables = {
              - "HUB_NAME"                       = "RSPON"
              - "INIT_FLOW_SNS_TOPIC_ARN"        = "arn:aws:sns:ap-southeast-3:209479276142:pgxflow-backend-initFlow"
              - "LAMBDA_CONCURRENCY_MARGIN"      = "200"
              - "PGXFLOW_BATCH_SUBMIT_QUEUE_URL" = "https://sqs.ap-southeast-3.amazonaws.com/209479276142/pgxflow-backend-batchSubmitQueue"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-batchStarter" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchStarter is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "7173152112757557256" -> null
      - triggers = {
          - "filename"  = "builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip"
          - "timestamp" = "1754895045343518000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchSubmit is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchSubmit" -> null
      - id                = "/aws/lambda/pgxflow-backend-batchSubmit" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-batchSubmit" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "STAGING"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all          = {
          - "Environment" = "STAGING"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_iam_role.lambda[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchSubmit is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::209479276142:role/pgxflow-backend-batchSubmit" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-09-16T08:40:22Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-batchSubmit" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-batchSubmit" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "STAGING"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all              = {
          - "Environment" = "STAGING"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "GXC"
        } -> null
      - unique_id             = "AROATBRPQCZXHQ3ZZGCDK" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-batchSubmit-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users"
                        },
                      - {
                          - Action   = "dynamodb:Query"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                              - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs",
                            ]
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = [
                              - "sqs:SendMessageBatch",
                              - "sqs:SendMessage",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sqs:ap-southeast-3:209479276142:pgxflow-backend-batchSubmitQueue"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-batchSubmit-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchSubmit:*:*",
                              - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchSubmit:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchSubmit is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-batchSubmit:pgxflow-backend-batchSubmit-0" -> null
      - name        = "pgxflow-backend-batchSubmit-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessageBatch",
                          - "sqs:SendMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:ap-southeast-3:209479276142:pgxflow-backend-batchSubmitQueue"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-batchSubmit" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_iam_role_policy.logs[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchSubmit is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-batchSubmit:pgxflow-backend-batchSubmit-logs" -> null
      - name        = "pgxflow-backend-batchSubmit-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchSubmit:*:*",
                          - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/pgxflow-backend-batchSubmit:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-batchSubmit" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be destroyed
  # (because module.pgxflow[0].module.lambda-batchSubmit is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-batchSubmit" -> null
      - code_sha256                    = "7W879pStzzz5frxPbe/WjEyv6LW3LqwO+sAK85u3eCo=" -> null
      - description                    = "Batch submission of PGxFlow jobs" -> null
      - filename                       = "builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip" -> null
      - function_name                  = "pgxflow-backend-batchSubmit" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-batchSubmit" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:pgxflow-backend-batchSubmit/invocations" -> n
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.